docs/Exemplos de XML/ConsultarLoteRps/ConsultarLoteRps.xml

<ConsultarLoteRpsEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
	<Prestador>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>
	</Prestador>
	<Protocolo></Protocolo>
</ConsultarLoteRpsEnvio>

-----------------------------------------------
<!-- Com o cabeçalho Soap -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.betha.com.br/e-nota-contribuinte-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <e:ConsultarLoteRps>
         <nfseCabecMsg>
					<![CDATA[
						 <cabecalho xmlns="http://www.betha.com.br/e-nota-contribuinte-ws" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
					]]>
				</nfseCabecMsg>
        <nfseDadosMsg>
					<![CDATA[
						<ConsultarLoteRpsEnvio xmlns="http://www.betha.com.br/e-nota-contribuinte-ws">
							<Prestador>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
							</Prestador>
							<Protocolo></Protocolo>
						</ConsultarLoteRpsEnvio>
					]]>
				</nfseDadosMsg>
      </e:ConsultarLoteRps>
   </soapenv:Body>
</soapenv:Envelope>